{
  "issues": [
    "Display Issues",
    "Systems Performance Issues",
    "Power & Battery Issues",
    "Driver or Software Issues",
    "Cosmetic & Physical Issues",
    "General Product Questions"
  ],
  "symptoms": [
    "Screen is not turning on but has power",
    "Screen is having low refresh rate",
    "Screen has intermittent flickering",
    "Screen color is not accurate",
    "Backlight bleeding",
    "Dead pixel or line on screen",
    "Blue screen appears intermittently",
    "Unable to boot to Windows",
    "Poor performance",
    "System overheating",
    "Unable to power on",
    "Battery Swelling",
    "Battery is not charging or detected",
    "Battery life is short",
    "Driver update failure",
    "BIOS update failure",
    "Windows OS is corrupted",
    "Screen is cracked",
    "Trackpad is cracked",
    "Trackpad is not responsive or lagging",
    "Keyboard keycap has printing issue",
    "Keyboard RGB is not working as expected (Uneven lighting)",
    "Keyboard is not responsive or lagging",
    "USB port not detected or dented",
    "Speakers are not working as expected",
    "Speaker grill detached from chassis",
    "Other cosmetic issue"
  ],
  "steps": [
    "Make sure your laptop has the latest Windows update.",
    "Make sure your laptop has the latest Graphics card update.",
    "Check if a software is causing the issue by closing all Razer apps and software.",
    "Connect to an external monitor.",
    "Ensure the power adapter is plugged in properly and laptop is charging.",
    "Perform a Pixel Test and look for any defective pixels. If any pixels are still defective, dead, or flickering after testing, the pixel is physically defective.",
    "Follow this guide on How to reduce light bleed on the Razer Blade display.",
    "Troubleshoot common Blue Screen of Death (BSOD) error codes.",
    "Attempt to remove the last software that you installed before the blue screens started to occur.",
    "Take a photo of the Error code (e.g. 0x0000009F).",
    "Reset the Razer Blade to its factory default settings.",
    "Check if the power cable is plugged in properly and the LED indicator on the Power Charger is lit up.",
    "Check if LED lights up on the keyboard.",
    "Check if the LCD monitor backlight is lit up.",
    "Check out Razer Blade does not have power, won't boot up or turn on.",
    "Check out Razer Blade boots into BIOS but not Windows OS.",
    "Take a photo/video of the error message or code, if there are any.",
    "Unplug ALL peripherals connected to your laptop before powering on.",
    "Restore BIOS to default settings.",
    "Check out How to fix low FPS when gaming.",
    "Clean air vents.",
    "Check out The battery on my Razer Blade looks swollen.",
    "Get a Battery Report and create an Energy Report from your Razer Blade.",
    "Prepare a photo or video that clearly shows the issue of your device.",
    "Check out The Razer Blade battery is either not charging or not detected.",
    "Check for any physical damage on the charging adapter and cables.",
    "Make sure your laptop has the latest BIOS update.",
    "Check out the Razer Blade System Recovery Image Online Service to obtain the recovery image for your laptop.",
    "Check out How to fix a Razer Blade that displays a blank or black screen.",
    "Check out How to resolve flickering or inconsistent brightness on a Razer Blade display.",
    "Adjust your screen resolution to match the screen resolution of the game or application.",
    "Check out How to improve the image quality, color, and resolution on a Razer Blade display.",
    "Ensure that there are no magnetic objects around your laptop screen or wrist rest.",
    "Check out How to keep the Razer Blade at optimal temperature while gaming.",
    "Check out How to access the BIOS settings on the Razer Blade.",
    "Connected to an external monitor and shows a display.",
    "Connected to an external monitor and does not show a display.",
    "Check out How to adjust or change the display refresh rate on a Razer Blade.",
    "Check out How to fix my Razer Blade when it freezes or locks up."
  ]
}