{
  "issues": [
    "Audio, Sound, & Connection Issues",
    "Cosmetic & Physical Issues",
    "Microphone Issues",
    "Power & Battery Issues",
    "General Product Questions"
  ],
  "symptoms": [
    "- No audio or sound",
    "- Crackling, rattling, distorted, static, buzzing",
    "- Audio balance issue",
    "- Audio cutting out or dropping",
    "- No sound from one earbud/earpiece",
    "- Low audio",
    "- Mic does not pick up sound",
    "- Muffled voice",
    "- Mic too sensitive",
    "- Distorted sound",
    "- Crackling sound",
    "- Low volume",
    "- Fading sound",
    "- Headset does not charge",
    "- Battery drains fast",
    "- Poor battery life",
    "- Headset won't power on",
    "- Other symptom not listed"
  ],
  "connections": [
    "USB Cable",
    "3.5mm Audio Cable",
    "Bluetooth",
    "Bluetooth via Phone",
    "Bluetooth via PC",
    "USB Dongle"
  ],
  "steps": [
    "- Get the latest Windows update.",
    "- Connect your headset directly to the PC and not a USB hub. Also try another USB port.",
    "- Update the firmware on your headset if it is on the list.",
    "- Fix sound or audio problems in Windows.",
    "- Ensure that your headset is set as the default playback device.",
    "- Check the audio ports and audio jack for any dirt or debris.",
    "- Confirm the audio jack is plugged in properly. If you are using a splitter cable, check if the splitter cable is causing the issue.",
    "- Ensure the systems onboard audio playback device (e.g., Realtek High-Definition Audio) is set as default.",
    "- Make sure your phone is compatible with your Razer headset.",
    "- Clean the attached silicone tips with a soft cloth lightly saturated with warm water.",
    "- Power is important. Verify earbuds are fully charged and turned on. Check your product user guide for best practices.",
    "- Update your device to the latest firmware via the Razer Audio app for iOS or Android.",
    "- Remove and re-pair the Bluetooth headset to your phone.",
    "- Test your headset with a different phone.",
    "- Power is important. Make sure your headset is fully charged before troubleshooting.",
    "- Switch it ON. Make sure the wireless mode is ON or the button is switched to the correct wireless mode. Check your product user guide on how to configure the wireless mode of your headset.",
    "- Download and run the Pairing Utility of your headset. If your device is not listed, skip this step.",
    "- Ensure your headset is set as the default playback device.",
    "- Clean dirt or debris that may obstruct the vents or diaphragm of your mic.",
    "- Ensure the audio ports and jacks are clean and the headset mic is properly attached.",
    "- Make sure the mic diaphragm is in front and the air vent is facing away from your mouth.",
    "- Make sure your apps can access the mic.",
    "- Ensure your headset is set as the default recording device.",
    "- Set Windows microphone level and microphone boost to values that works well for your setup.",
    "- Check if a software is causing the issue by closing all Razer apps and software.",
    "- If closing Razer Synapse fixed the issue, reinstall your headset drivers, including Razer Synapse, Razer 7.1 Surround Sound or THX Spatial Audio. Restart your PC then test your headset.",
    "- If the issue only happens while Razer Synapse is running, logout from Razer Synapse and test with another Razer account.",
    "- Test your headset on another PC and verify if the issue still exists.",
    "- Agreed to the terms and conditions of the limited warranty."
  ]
}